app/views/orders/_items.html.erb

SELECT "shoppe_order_items".* FROM "shoppe_order_items" WHERE "shoppe_order_items"."order_id" = ?  [["order_id", 5]]
---
    <tbody>
      <% order.order_items.each do |item| %>